compressible/resonators/sinusoidal_velocity/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       895;
    }
    right
    {
        type            patch;
        nFaces          5;
        startFace       995;
    }
    bottom_axis
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       1000;
    }
    left
    {
        type            patch;
        nFaces          5;
        startFace       1100;
    }
    frontAndBackPlanes
    {
        type            empty;
        inGroups        1(empty);
        nFaces          1000;
        startFace       1105;
    }
)

// ************************************************************************* //
